# 
Import the necessary libraries

In [1]:
import pandas as pd

# Import the dataset from this(https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [4]:


url="https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

In [ ]:
users = pd.read_csv(url, sep="|", index_col="user_id")

# 
Assign it to a variable called users and use the 'user_id' as index

In [7]:
users=pd.read_csv(url,sep="|",index_col="user_id")

In [8]:
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

# 
See the first 10 and last 10 entries

In [11]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [12]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# What is the number of observations in the dataset?

In [13]:
users.count(axis=0)

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

# What is the number of columns in the dataset?

In [16]:
users.columns.shape

(4,)

# 
Print the name of all the columns.

In [17]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# 
How is the dataset indexed?

In [18]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

# 
What is the data type of each column?

In [21]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

# 
Print only the occupation column

In [24]:
users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

# How many different occupations are in this dataset?

In [27]:
users["occupation"].nunique

<bound method IndexOpsMixin.nunique of user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object>

In [28]:
users["occupation"].nunique()

21

# 
What is the most frequent occupation?

In [34]:
users["occupation"].value_counts().sort_values(ascending=False).head(1)

student    196
Name: occupation, dtype: int64

# 
DataFrame Info.

In [40]:
users.info

<bound method DataFrame.info of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

# 
Describe all the columns

In [41]:
users.describe

<bound method NDFrame.describe of          age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]>

# Summarize only the occupation column

In [42]:


users["occupation"].value_counts().sort_values(ascending=False)

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [44]:
users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

# What is the mean age of users?

In [45]:
users["age"].mean()

34.05196182396607

# 
What is the age with least occurrence?

In [50]:
users["age"].value_counts().tail()

7     1
66    1
10    1
11    1
73    1
Name: age, dtype: int64

In [49]:
users["age"].value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
10     1
11     1
73     1
Name: age, Length: 61, dtype: int64